// قائمة الـ IDs المقبولة (تأكد أنها 10 أرقام)
const ALLOWED_IDS = [
    "1554468451",
    "1555599565",
    "1555759513",
    "1553276807",
    "1555390551",
    "1555453163",
    "1555675303",
    "1555388331",
    "1555015517",
    "1465516645",
    "1555654945",
    "1555586903",
    "1555499667",
    "1554951445",
    "1555427021",
    "1555743339",
    "1555449189",
    "1555401445",
    "1555442933",
    "1555378271",
    "1555152015",
    "1555359905",
    "1555333381",
    "1554415217",
    "1555469579",
    "1555383987",
    "1822828838",
    "1555351801",
    "1554954305",
    "1555003695",
    "1553470613",
    "1554950571",
    "1552582741",
    "1555340919",
    "1554718079",
    "1554875929",
    "1553773147",
    "1553276807",
    "1554860909",
    "1555011253",
    "1553839531",
    "1553773147",
    "1554546957",
    "1554854779",
    "1551127863",
    "1554780143",
    "1554831589",
    "1554801965",
    "1554684963",
    "1554554193",
    "1553697027",
    "1554715081",
    "1554517553",
    "1554578267",
    "1550301477",
    "1554562445",
    "1554529799",
    "1554641781",
    "1554505875",
    "1553851911",
    "1553847377",
    "1554226135",
    "1554496097",
    "1554356173",
    "1554233391",
    "1554224455",
    "1344556675",
    "1554219249",
    "1553835221",
    "1554034205",
    "1553568899",
    "1553917485",
    "1554258991",
    "1553839531",
    "1553716791",
    "1553713523",
    "1553726671",
    "1554319729",
    "1553696781",
    "1918771800",
    "1553693811",
]; 

const btn = document.getElementById('check-btn');
const input = document.getElementById('user-id');
const modal = document.getElementById('loading-modal');
const msg = document.getElementById('msg-box');

btn.addEventListener('click', () => {
    const val = input.value;

    // 1. التحقق من الطول (10 أرقام)
    if(val.length !== 10) {
        msg.innerText = "خطأ: يجب أن يتكون الـ ID من 10 أرقام.";
        msg.style.color = "red";
        return;
    }

    // 2. إظهار نافذة التحميل
    modal.style.display = 'flex';

    // 3. محاكاة الاتصال بالسيرفر (3 ثواني)
    setTimeout(() => {
        // التحقق من القائمة
        if(ALLOWED_IDS.includes(val)) {
            window.location.href = 'results.html';
        } else {
            modal.style.display = 'none';
            msg.innerText = "تم رفض الوصول: هذا الـ ID غير مسجل.";
            msg.style.color = "red";
        }
    }, 3000);

});





















































































